# Используем официальный образ Node.js версии 18
FROM node:18.13.0

# Создаем рабочую директорию внутри контейнера
WORKDIR /app

# Копируем package.json и package-lock.json (если он есть)
COPY package*.json ./

# Устанавливаем зависимости
RUN npm install

# Копируем остальные файлы проекта в рабочую директорию
COPY . .

# Открываем порт 3006 для доступа к приложению
EXPOSE 3006

# Указываем переменные окружения
ENV PORT=3006
ENV HOST=0.0.0.0

# Команда для запуска приложения
CMD ["npm", "run", "start:docker"]